app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('AAA', 'profy.jpg', 1, 1, '2019-07-18 08:15:46', '2019-07-18 08:15:46')
---
json.image @message.image.url
json.created_at @message.created_at.strftime("%Y/%m/%d %H:%M")