app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE('%%')) AND (`users`.`name` != '大庭 貫治 ')
---
  def index
    @users = User.where('name LIKE(?)' , "%#{params[:name]}%")